Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: فأصحاب الميمنة ما أصحاب الميمنة
en: Then (there will be) the Companions of the Right Hand;- What will be the Companions of the Right Hand?

source: وأصحاب المشأمة ما أصحاب المشأمة
en: And the Companions of the Left Hand,- what will be the Companions of the Left Hand?

source: والسابقون السابقون
en: And those Foremost (in Faith) will be Foremost (in the Hereafter).

source: أولئك المقربون
en: These will be those Nearest to Allah:

source: ثلة من الأولين
en: A number of people from those of old,

source: وقليل من الآخرين
en: And a few from those of later times.

source: على سرر موضونة
en: (They will be) on Thrones encrusted (with gold and precious stones),

source: متكئين عليها متقابلين
en: Reclining on them, facing each other.

source: يطوف عليهم ولدان مخلدون
en: Round about them will (serve) youths of perpetual (freshness),

source: بأكواب وأباريق وكأس من معين
en: With goblets, (shining) beakers, and cups (filled) out of clear-flowing fountains:

source: لا يصدعون عنها ولا ينزفون
en: No after-ache will they receive therefrom, nor will they suffer intoxication:

source: وفاكهة مما يتخيرون
en: And with fruits, any that they may select:

source: ولحم طير مما يشتهون
en: And the flesh of fowls, any that they may desire.

source: وحور عين
en: And (there will be) Companions with beautiful, big, and lustrous eyes,-

source: كأمثال اللؤلؤ المكنون
en: Like unto Pearls well-guarded.

source: جزاء بما كانوا يعملون
en: A Reward for the deeds of their past (life).

source: لا يسمعون فيها لغوا ولا تأثيما
en: Not frivolity will they hear therein, nor any taint of ill,-

source: إلا قيلا سلاما سلاما
en: Only the saying, "Peace! Peace".

source: وأصحاب اليمين ما أصحاب اليمين
en: The Companions of the Right Hand,- what will be the Companions of the Right Hand?

source: في سدر مخضود
en: (They will be) among Lote-trees without thorns,

source: وطلح منضود
en: Among Talh trees with flowers (or fruits) piled one above another,-

source: وظل ممدود
en: In shade long-extended,

source: وماء مسكوب
en: By water flowing constantly,

source: وفاكهة كثيرة
en: And fruit in abundance.

source: لا مقطوعة ولا ممنوعة
en: Whose season is not limited, nor (supply) forbidden,

source: وفرش مرفوعة
en: And on Thrones (of Dignity), raised high.

source: إنا أنشأناهن إنشاء
en: We have created (their Companions) of special creation.

source: فجعلناهن أبكارا
en: And made them virgin - pure (and undefiled), -

source: عربا أترابا
en: Beloved (by nature), equal in age,-

source: لأصحاب اليمين
en: For the Companions of the Right Hand.

source: وثلة من الآخرين
en: And a (goodly) number from those of later times.

source: وأصحاب الشمال ما أصحاب الشمال
en: The Companions of the Left Hand,- what will be the Companions of the Left Hand?

source: في سموم وحميم
en: (They will be) in the midst of a Fierce Blast of Fire and in Boiling Water,

source: وظل من يحموم
en: And in the shades of Black Smoke:

source: لا بارد ولا كريم
en: Nothing (will there be) to refresh, nor to please:

source: إنهم كانوا قبل ذلك مترفين
en: For that they were wont to be indulged, before that, in wealth (and luxury),

source: وكانوا يصرون على الحنث العظيم
en: And persisted obstinately in wickedness supreme!

source: وكانوا يقولون أئذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: And they used to say, "What! when we die and become dust and bones, shall we then indeed be raised up again?-

source: قل إن الأولين والآخرين
en: Say: "Yea, those of old and those of later times,

source: لمجموعون إلى ميقات يوم معلوم
en: "All will certainly be gathered together for the meeting appointed for a Day well-known.

source: ثم إنكم أيها الضالون المكذبون
en: "Then will ye truly,- O ye that go wrong, and treat (Truth) as Falsehood!-

source: لآكلون من شجر من زقوم
en: "Ye will surely taste of the Tree of Zaqqum.

source: فمالئون منها البطون
en: "Then will ye fill your insides therewith,

source: فشاربون عليه من الحميم
en: "And drink Boiling Water on top of it:

source: فشاربون شرب الهيم
en: "Indeed ye shall drink like diseased camels raging with thirst!"

source: هذا نزلهم يوم الدين
en: Such will be their entertainment on the Day of Requital!

source: نحن خلقناكم فلولا تصدقون
en: It is We Who have created you: why will ye not witness the Truth?

source: أفرأيتم ما تمنون
en: Do ye then see?- The (human Seed) that ye throw out,-

source: أأنتم تخلقونه أم نحن الخالقون
en: Is it ye who create it, or are We the Creators?

source: نحن قدرنا بينكم الموت وما نحن بمسبوقين
en: We have decreed Death to be your common lot, and We are not to be frustrated

source: على أن نبدل أمثالكم وننشئكم في ما لا تعلمون
en: from changing your Forms and creating you (again) in (forms) that ye know not.

source: ولقد علمتم النشأة الأولى فلولا تذكرون
en: And ye certainly know already the first form of creation: why then do ye not celebrate His praises?

source: أفرأيتم ما تحرثون
en: See ye the seed that ye sow in the ground?

source: أأنتم تزرعونه أم نحن الزارعون
en: Is it ye that cause it to grow, or are We the Cause?

source: لو نشاء لجعلناه حطاما فظلتم تفكهون
en: Were it Our Will, We could crumble it to dry powder, and ye would be left in wonderment,

source: إنا لمغرمون
en: (Saying), "We are indeed left with debts (for nothing):

source: بل نحن محرومون
en: "Indeed are we shut out (of the fruits of our labour)"

source: أفرأيتم الماء الذي تشربون
en: See ye the water which ye drink?

source: أأنتم أنزلتموه من المزن أم نحن المنزلون
en: Do ye bring it down (in rain) from the cloud or do We?

source: لو نشاء جعلناه أجاجا فلولا تشكرون
en: Were it Our Will, We could make it salt (and unpalatable): then why do ye not give thanks?

source: أفرأيتم النار التي تورون
en: See ye the Fire which ye kindle?

source: أأنتم أنشأتم شجرتها أم نحن المنشئون
en: Is it ye who grow the tree which feeds the fire, or do We grow it?

source: نحن جعلناها تذكرة ومتاعا للمقوين
en: We have made it a memorial (of Our handiwork), and an article of comfort and convenience for the denizens of deserts.

source: فسبح باسم ربك العظيم
en: Then celebrate with praises the name of thy Lord, the Supreme!

source: فلا أقسم بمواقع النجوم
en: Furthermore I call to witness the setting of the Stars,-

source: وإنه لقسم لو تعلمون عظيم
en: And that is indeed a mighty adjuration if ye but knew,-

source: إنه لقرآن كريم
en: That this is indeed a qur'an Most Honourable,

source: في كتاب مكنون
en: In Book well-guarded,

source: لا يمسه إلا المطهرون
en: Which none shall touch but those who are clean:

source: تنزيل من رب العالمين
en: A Revelation from the Lord of the Worlds.

source: أفبهذا الحديث أنتم مدهنون
en: Is it such a Message that ye would hold in light esteem?

source: وتجعلون رزقكم أنكم تكذبون
en: And have ye made it your livelihood that ye should declare it false?

source: فلولا إذا بلغت الحلقوم
en: Then why do ye not (intervene) when (the soul of the dying man) reaches the throat,-

source: وأنتم حينئذ تنظرون
en: And ye the while (sit) looking on,-

source: ونحن أقرب إليه منكم ولكن لا تبصرون
en: But We are nearer to him than ye, and yet see not,-

source: فلولا إن كنتم غير مدينين
en: Then why do ye not,- If you are exempt from (future) account,-

source: ترجعونها إن كنتم صادقين
en: Call back the soul, if ye are true (in the claim of independence)?

source: فأما إن كان من المقربين
en: Thus, then, if he be of those Nearest to Allah,

source: فروح وريحان وجنت نعيم
en: (There is for him) Rest and Satisfaction, and a Garden of Delights.

source: وأما إن كان من أصحاب اليمين
en: And if he be of the Companions of the Right Hand,

source: فسلام لك من أصحاب اليمين
en: (For him is the salutation), "Peace be unto thee", from the Companions of the Right Hand.

source: وأما إن كان من المكذبين الضالين
en: And if he be of those who treat (Truth) as Falsehood, who go wrong,

source: فنزل من حميم
en: For him is Entertainment with Boiling Water.

source: وتصلية جحيم
en: And burning in Hell-Fire.

source: إن هذا لهو حق اليقين
en: Verily, this is the Very Truth and Certainly.

source: سبح لله ما في السماوات والأرض وهو العزيز الحكيم
en: Whatever is in the heavens and on earth,- let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise.

source: له ملك السماوات والأرض يحيي ويميت وهو على كل شيء قدير
en: To Him belongs the dominion of the heavens and the earth: It is He Who gives Life and Death; and He has Power over all things.

source: هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم
en: He is the First and the Last, the Evident and the Immanent: and He has full knowledge of all things.

source: هو الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم أين ما كنتم والله بما تعملون بصير
en: He it is Who created the heavens and the earth in Six Days, and is moreover firmly established on the Throne (of Authority). He knows what enters within the earth and what comes forth out of it, what comes down from heaven and what mounts up to it. And He is with you wheresoever ye may be. And Allah sees well all that ye do.

source: له ملك السماوات والأرض وإلى الله ترجع الأمور
en: To Him belongs the dominion of the heavens and the earth: and all affairs are referred back to Allah.

source: يولج الليل في النهار ويولج النهار في الليل وهو عليم بذات الصدور
en: He merges Night into Day, and He merges Day into Night; and He has full knowledge of the secrets of (all) hearts.

source: آمنوا بالله ورسوله وأنفقوا مما جعلكم مستخلفين فيه فالذين آمنوا منكم وأنفقوا لهم أجر كبير
en: Believe in Allah and His messenger, and spend (in charity) out of the (substance) whereof He has made you heirs. For, those of you who believe and spend (in charity),- for them is a great Reward.

source: وما لكم لا تؤمنون بالله والرسول يدعوكم لتؤمنوا بربكم وقد أخذ ميثاقكم إن كنتم مؤمنين
en: What cause have ye why ye should not believe in Allah?- and the Messenger invites you to believe in your Lord, and has indeed taken your Covenant, if ye are men of Faith.

source: هو الذي ينزل على عبده آيات بينات ليخرجكم من الظلمات إلى النور وإن الله بكم لرءوف رحيم
en: He is the One Who sends to His Servant Manifest Signs, that He may lead you from the depths of Darkness into the Light and verily Allah is to you most kind and Merciful.

source: وما لكم ألا تنفقوا في سبيل الله ولله ميراث السماوات والأرض لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلا وعد الله الحسنى والله بما تعملون خبير
en: And what cause have ye why ye should not spend in the cause of Allah?- For to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent (freely) and fought, before the Victory, (with those who did so later). Those are higher in rank than those who spent (freely) and fought afterwards. But to all has Allah promised a goodly (reward). And Allah is well acquainted with all that ye do.

source: من ذا الذي يقرض الله قرضا حسنا فيضاعفه له وله أجر كريم
en: Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward.

source: يوم ترى المؤمنين والمؤمنات يسعى نورهم بين أيديهم وبأيمانهم بشراكم اليوم جنات تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم
en: One Day shalt thou see the believing men and the believing women- how their Light runs forward before them and by their right hands: (their greeting will be): "Good News for you this Day! Gardens beneath which flow rivers! to dwell therein for aye! This is indeed the highest Achievement!"

source: يوم يقول المنافقون والمنافقات للذين آمنوا انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نورا فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب
en: One Day will the Hypocrites- men and women - say to the Believers: "Wait for us! Let us borrow (a Light) from your Light!" It will be said: "Turn ye back to your rear! then seek a Light (where ye can)!" So a wall will be put up betwixt them, with a gate therein. Within it will be Mercy throughout, and without it, all alongside, will be (Wrath and) Punishment!

source: ينادونهم ألم نكن معكم قالوا بلى ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني حتى جاء أمر الله وغركم بالله الغرور
en: (Those without) will call out, "Were we not with you?" (The others) will reply, "True! but ye led yourselves into temptation; ye looked forward (to our ruin); ye doubted (Allah's Promise); and (your false) desires deceived you; until there issued the Command of Allah. And the Deceiver deceived you in respect of Allah.

source: فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا مأواكم النار هي مولاكم وبئس المصير
en: "This Day shall no ransom be accepted of you, nor of those who rejected Allah." Your abode is the Fire: that is the proper place to claim you: and an evil refuge it is!"

source: ألم يأن للذين آمنوا أن تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا كالذين أوتوا الكتاب من قبل فطال عليهم الأمد فقست قلوبهم وكثير منهم فاسقون
en: Has not the Time arrived for the Believers that their hearts in all humility should engage in the remembrance of Allah and of the Truth which has been revealed (to them), and that they should not become like those to whom was given Revelation aforetime, but long ages passed over them and their hearts grew hard? For many among them are rebellious transgressors.

source: اعلموا أن الله يحيي الأرض بعد موتها قد بينا لكم الآيات لعلكم تعقلون
en: Know ye (all) that Allah giveth life to the earth after its death! already have We shown the Signs plainly to you, that ye may learn wisdom.

source: إن المصدقين والمصدقات وأقرضوا الله قرضا حسنا يضاعف لهم ولهم أجر كريم
en: For those who give in Charity, men and women, and loan to Allah a Beautiful Loan, it shall be increased manifold (to their credit), and they shall have (besides) a liberal reward.

source: والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ونورهم والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم
en: And those who believe in Allah and His messengers- they are the Sincere (lovers of Truth), and the witnesses (who testify), in the eyes of their Lord: They shall have their Reward and their Light. But those who reject Allah and deny Our Signs,- they are the Companions of Hell-Fire.

source: اعلموا أنما الحياة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الأموال والأولاد كمثل غيث أعجب الكفار نباته ثم يهيج فتراه مصفرا ثم يكون حطاما وفي الآخرة عذاب شديد ومغفرة من الله ورضوان وما الحياة الدنيا إلا متاع الغرور
en: Know ye (all), that the life of this world is but play and amusement, pomp and mutual boasting and multiplying, (in rivalry) among yourselves, riches and children. Here is a similitude: How rain and the growth which it brings forth, delight (the hearts of) the tillers; soon it withers; thou wilt see it grow yellow; then it becomes dry and crumbles away. But in the Hereafter is a Penalty severe (for the devotees of wrong). And Forgiveness from Allah and (His) Good Pleasure (for the devotees of Allah). And what is the life of this world, but goods and chattels of deception?

source: سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض أعدت للذين آمنوا بالله ورسله ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم
en: Be ye foremost (in seeking) Forgiveness from your Lord, and a Garden (of Bliss), the width whereof is as the width of heaven and earth, prepared for those who believe in Allah and His messengers: that is the Grace of Allah, which He bestows on whom he pleases: and Allah is the Lord of Grace abounding.

source: ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها إن ذلك على الله يسير
en: No misfortune can happen on earth or in your souls but is recorded in a decree before We bring it into existence: That is truly easy for Allah:

source: لكيلا تأسوا على ما فاتكم ولا تفرحوا بما آتاكم والله لا يحب كل مختال فخور
en: In order that ye may not despair over matters that pass you by, nor exult over favours bestowed upon you. For Allah loveth not any vainglorious boaster,-

source: الذين يبخلون ويأمرون الناس بالبخل ومن يتول فإن الله هو الغني الحميد
en: Such persons as are covetous and commend covetousness to men. And if any turn back (from Allah's Way), verily Allah is Free of all Needs, Worthy of all Praise.

source: لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط وأنزلنا الحديد فيه بأس شديد ومنافع للناس وليعلم الله من ينصره ورسله بالغيب إن الله قوي عزيز
en: We sent aforetime our messengers with Clear Signs and sent down with them the Book and the Balance (of Right and Wrong), that men may stand forth in justice; and We sent down Iron, in which is (material for) mighty war, as well as many benefits for mankind, that Allah may test who it is that will help, Unseen, Him and His messengers: For Allah is Full of Strength, Exalted in Might (and able to enforce His Will).

source: ولقد أرسلنا نوحا وإبراهيم وجعلنا في ذريتهما النبوة والكتاب فمنهم مهتد وكثير منهم فاسقون
en: And We sent Noah and Abraham, and established in their line Prophethood and Revelation: and some of them were on right guidance. But many of them became rebellious transgressors.

source: ثم قفينا على آثارهم برسلنا وقفينا بعيسى ابن مريم وآتيناه الإنجيل وجعلنا في قلوب الذين اتبعوه رأفة ورحمة ورهبانية ابتدعوها ما كتبناها عليهم إلا ابتغاء رضوان الله فما رعوها حق رعايتها فآتينا الذين آمنوا منهم أجرهم وكثير منهم فاسقون
en: Then, in their wake, We followed them up with (others of) Our messengers: We sent after them Jesus the son of Mary, and bestowed on him the Gospel; and We ordained in the hearts of those who followed him Compassion and Mercy. But the Monasticism which they invented for themselves, We did not prescribe for them: (We commanded) only the seeking for the Good Pleasure of Allah; but that they did not foster as they should have done. Yet We bestowed, on those among them who believed, their (due) reward, but many of them are rebellious transgressors.

source: يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله يؤتكم كفلين من رحمته ويجعل لكم نورا تمشون به ويغفر لكم والله غفور رحيم
en: O ye that believe! Fear Allah, and believe in His Messenger, and He will bestow on you a double portion of His Mercy: He will provide for you a Light by which ye shall walk (straight in your path), and He will forgive you (your past): for Allah is Oft-Forgiving, Most Merciful.

source: لئلا يعلم أهل الكتاب ألا يقدرون على شيء من فضل الله وأن الفضل بيد الله يؤتيه من يشاء والله ذو الفضل العظيم
en: That the People of the Book may know that they have no power whatever over the Grace of Allah, that (His) Grace is (entirely) in His Hand, to bestow it on whomsoever He wills. For Allah is the Lord of Grace abounding.

source: قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما إن الله سميع بصير
en: Allah has indeed heard (and accepted) the statement of the woman who pleads with thee concerning her husband and carries her complaint (in prayer) to Allah: and Allah (always) hears the arguments between both sides among you: for Allah hears and sees (all things).

source: الذين يظاهرون منكم من نسائهم ما هن أمهاتهم إن أمهاتهم إلا اللائي ولدنهم وإنهم ليقولون منكرا من القول وزورا وإن الله لعفو غفور
en: If any men among you divorce their wives by Zihar (calling them mothers), they cannot be their mothers: None can be their mothers except those who gave them birth. And in fact they use words (both) iniquitous and false: but truly Allah is one that blots out (sins), and forgives (again and again).

source: والذين يظاهرون من نسائهم ثم يعودون لما قالوا فتحرير رقبة من قبل أن يتماسا ذلكم توعظون به والله بما تعملون خبير
en: But those who divorce their wives by Zihar, then wish to go back on the words they uttered,- (It is ordained that such a one) should free a slave before they touch each other: Thus are ye admonished to perform: and Allah is well-acquainted with (all) that ye do.

source: فمن لم يجد فصيام شهرين متتابعين من قبل أن يتماسا فمن لم يستطع فإطعام ستين مسكينا ذلك لتؤمنوا بالله ورسوله وتلك حدود الله وللكافرين عذاب أليم
en: And if any has not (the wherewithal), he should fast for two months consecutively before they touch each other. But if any is unable to do so, he should feed sixty indigent ones, this, that ye may show your faith in Allah and His Messenger. Those are limits (set by) Allah. For those who reject (Him), there is a grievous Penalty.

source: إن الذين يحادون الله ورسوله كبتوا كما كبت الذين من قبلهم وقد أنزلنا آيات بينات وللكافرين عذاب مهين
en: Those who resist Allah and His Messenger will be humbled to dust, as were those before them: for We have already sent down Clear Signs. And the Unbelievers (will have) a humiliating Penalty,-

source: يوم يبعثهم الله جميعا فينبئهم بما عملوا أحصاه الله ونسوه والله على كل شيء شهيد
en: On the Day that Allah will raise them all up (again) and show them the Truth (and meaning) of their conduct. Allah has reckoned its (value), though they may have forgotten it, for Allah is Witness to all things.

source: ألم تر أن الله يعلم ما في السماوات وما في الأرض ما يكون من نجوى ثلاثة إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أين ما كانوا ثم ينبئهم بما عملوا يوم القيامة إن الله بكل شيء عليم
en: Seest thou not that Allah doth know (all) that is in the heavens and on earth? There is not a secret consultation between three, but He makes the fourth among them, - Nor between five but He makes the sixth,- nor between fewer nor more, but He is in their midst, wheresoever they be: In the end will He tell them the truth of their conduct, on the Day of Judgment. For Allah has full knowledge of all things.

source: ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه ويتناجون بالإثم والعدوان ومعصيت الرسول وإذا جاءوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير
en: Turnest thou not thy sight towards those who were forbidden secret counsels yet revert to that which they were forbidden (to do)? And they hold secret counsels among themselves for iniquity and hostility, and disobedience to the Messenger. And when they come to thee, they salute thee, not as Allah salutes thee, (but in crooked ways): And they say to themselves, "Why does not Allah punish us for our words?" Enough for them is Hell: In it will they burn, and evil is that destination!

source: يا أيها الذين آمنوا إذا تناجيتم فلا تتناجوا بالإثم والعدوان ومعصيت الرسول وتناجوا بالبر والتقوى واتقوا الله الذي إليه تحشرون
en: O ye who believe! When ye hold secret counsel, do it not for iniquity and hostility, and disobedience to the Prophet; but do it for righteousness and self-restraint; and fear Allah, to Whom ye shall be brought back.

source: إنما النجوى من الشيطان ليحزن الذين آمنوا وليس بضارهم شيئا إلا بإذن الله وعلى الله فليتوكل المؤمنون
en: Secret counsels are only (inspired) by the Evil One, in order that he may cause grief to the Believers; but he cannot harm them in the least, except as Allah permits; and on Allah let the Believers put their trust.

source: يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس فافسحوا يفسح الله لكم وإذا قيل انشزوا فانشزوا يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير
en: O ye who believe! When ye are told to make room in the assemblies, (spread out and) make room: (ample) room will Allah provide for you. And when ye are told to rise up, rise up Allah will rise up, to (suitable) ranks (and degrees), those of you who believe and who have been granted (mystic) Knowledge. And Allah is well-acquainted with all ye do.

source: يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدي نجواكم صدقة ذلك خير لكم وأطهر فإن لم تجدوا فإن الله غفور رحيم
en: O ye who believe! When ye consult the Messenger in private, spend something in charity before your private consultation. That will be best for you, and most conducive to purity (of conduct). But if ye find not (the wherewithal), Allah is Oft-Forgiving, Most Merciful.
